{
 "fullName": "Shubham Gupta",
 "links": {
  "linkedin": "https://www.linkedin.com/in/shubham-gupta-103929108/",
  "github": "https://github.com/shubham-pyc"
 },
 "skills": [
  "Javascript",
  "ReactJS, NodeJs",
  "Jquery/HTML/CSS",
  "Python",
  "Django",
  "Django Rest Framework",
  "Pytorch",
  "Tensorflow",
  "Databases: Posgres, MySql, Cassandra",
  "Rest",
  "Google Analytics",
  "Decentralized Applications (DApps)",
  "Git/Github"
 ],
 "about": "\n      Shubham is a problem solver who has an insatiable hunger for creating and learning new things. He is a voracious reader and an excellent researcher which helps him achieve solutions to problems he wants to solve. His ability to think out of the box sets him apart from the crowd.\n      Shubham is a programmer at heart and he love to watch animes whenever he is free.\n  ",
 "birthDate": "April 24, 1996",
 "jobTitle": "Full Stack Engineer",
 "email": "shubham-pyc@gmail.com",
 "skillDescription": "I am a passionate innovator who works on creating useful tools which ease out functioning & enable real-time actions resulting in effective operations & greater ROI for businesses.\n  I excel at analyzing pain areas, identifying values for any existing workflow or system and thus ideating & implementing new software products from head to tail to address identified concerns. I strive to constantly contribute in resolving day to day problems via frequent connect with people to understand the pain points & then utilize technology innovation to solve them. ",
 "profileDescription": "I am working in IT industry for last 5 years, specializing in turnarounds, revitalization and innovation. Ultimately delivering high quality useful products and services.\n  I am always striving to bring 100% to the work I do and my goal is to create useful tools which ease out functioning & greater return for businesses.",
 "workExperience": [
  {
   "position": "Graduate Research Assistant",
   "type": "work",
   "from": "Aug 2021",
   "to": "Present",
   "companyName": "CeLab: Utah State University",
   "description": "-Pathline Prediction of a Fluid Simulation: Developed a novel end-to-end neural network architecture for efficient feature matching in fluid simulation using the NEK5000 code. This architecture is a hybrid of feature fusion and long short-term memory (LSTM) networks, and is designed to extract spatiotemporal features from the vector field in order to predict pathlines. The results of this approach were nearly perfect in terms of reconstruction, outperforming the current state-of-the-art network in both performance and accuracy.\n\n -Successfully utilized Magnitude Pruning to prune a Multi-Layer Perceptron (MLP) model, reducing the number of parameters from 8 million to 2 million. This resulted in the ability to perform real-time visualization of the Double Gyre dataset within a web browser, demonstrating expertise in model compression and efficient data visualization."
  },
  {
   "position": "Software Engineer Intern",
   "type": "work",
   "from": "May 2022",
   "to": "Aug 2022",
   "companyName": "Knox Financial",
   "description": "-Implemented an in-house solution to transfer production data from Salesforce to a sandbox environment, which typically incurs a charge of 30% of the company's annual spend. This solution saved the company $45,000 per year.\n\n -Architected and developed an interactive map that presents relevant data including exact location of leads and driving distances between new potential market territories.-Automated the tedious manual task for downloading quarterly statements from Property management software for the customers.This tool saves $2300 per year, as it took 3 days for operation team do it."
  },
  {
   "position": "Sr. Fullstack Engineer",
   "type": "work",
   "from": "Dec 2020",
   "to": "Aug 2021",
   "companyName": "Es Magico Experiences",
   "description": "- Specialized in creating projects from scratch and overlooking engineer breakthroughs \nfrom whitepapers to production deployment.\n- Worked in an agile team using Atlassian Tools and Git\n- Experimented with real-time distributed data processing with Python Celery(Distributed Task queue).\n- Experimented SQL(PostgreSQL) and NoSQL(MongoDB, Redis, Firebase) databases.\n- Experimenting on developing web applications with Django Backend, React Frontend\n - Experienced with CI/CD with Jenkins\n - Experienced with DevOps technologies such as Docker, Docker-Compose"
  },
  {
   "position": "Software Engineer",
   "type": "work",
   "from": "Jul 2019",
   "to": "Nov 2020",
   "companyName": "Impetus Technologies",
   "description": "- Created Flight Search Result(FSR) module for an aviation domain company's (Fortune  500) Digital Optimization (Experimentation) project. Did various optimization to improve the performance and revenue.\n        - Devised a unique way to perform a/b testing on single page application (react) which made them release independent. Thus reducing the feature release cycle  from 44 days to 14 days.\n        - Created a decentralized gambling platform on top of ethereum blockchain.\n        - Analyzing systems, identifying problems and Ideating solutions \n        - Designed & implemented frameworks, defined technology standards, methodologies.\n        "
  },
  {
   "position": "Associate Software Engineer",
   "type": "work",
   "from": "May 2018",
   "to": "Jul 2019",
   "companyName": "Impetus Infotech",
   "description": "\n            - Part of the aviation domain digital analytics and Digital optimization (Experimentation). \n            My responsibilities: \n            - Writing production level javascript code to enhance the user interface with accessibility features(aria)\n            - Writing tracking code to analyze how the user behaves on the website.\n            - Code review of other team members\n            - Collaborating with multiple teams to understand the new requirements and provide the best solution.\n            - Looking after the whole lifecycle of A/B test using oracle maxymiser.\n\n            Built an Intelligent program which:\n            1) Automates the code writing process which generates 60% of the code which is required. \n            2) It simultaneously creates Stories and Subtasks according to the requirement on JIRA with appropriate story points and description\n            3) Pushes code on GIT and Maximizer simultaneously\n            This helps us save 400 man-hours yearly and due to that, I was awarded as a Bright Beginner, an Award given to the new & exceptional people in our organization."
  }
 ],
 "education": [
  {
   "position": "Master's in Computer Science",
   "type": "education",
   "from": "Aug 2021",
   "to": "May 2023",
   "companyName": "Utah State University",
   "description": "Thesis Topic: Transfer Learning to accelerate pathline prediction of fluid flows\n Coursework: Deep Learning, Compiler Construction, Virtual Reality, Computer Vision, High Performance Computing"
  },
  {
   "position": "Bachelor Degree",
   "type": "education",
   "from": "Aug 2014",
   "to": "May 2018",
   "companyName": "RGPV",
   "description": "I have done my Bachelor of Engineering focused in Information Techonology.\n                    Some of the courses I took:\n                    - Cryptography\n                    - Algoritms and Data Structures\n                    - Machine Learning\n                    - Web development\n                    "
  }
 ],
 "projects": [
  
  {
   "projectName": "C- Compiler",
   "imageUrl": "images/portfolio/compiler.jpg",
   "projectCategory": "Compiler Construction",
   "projectLink": "https://github.com/shubham-pyc/c-minus",
   "projectDescription": ""
  },
  {
   "projectName": "Image Segmentation Using K-Means Clustering Implemented in CUDA",
   "imageUrl": "images/portfolio/covid.png",
   "projectCategory": "Computer Vision/ High Performance Computing",
   "projectLink": "",
   "projectDescription": ""
  },
  {
   "imageUrl": "images/portfolio/hand-gestures.png",
   "projectName": "Hand gesture recognition",
   "projectCategory": "Deep Leanring",
   "projectLink": "https://github.com/shubham-pyc/Handgesture-Recognition",
   "projectDescription": "A Framework for training Neural Network with custom hand gestures. (GitHub link in project URL)\n          - Implemented custom image collector which take images from webcam removes noise, resizes, converts RBG images to binary images and stores on disk\n          - Created a custom image flattener to convert pixel data to useful information which can be fed to the neural network, applied feature engineering. \n          - Built setup script which automatically installs all required dependencies so the project is ready to run in one command\n          - Forged gesture recognized which is the Neural Network trained by input images provided by the image collector, successfully recognizes new images from the webcam \n          Advantages - \n          1) Trainability - NN can be trained with this framework in 10 lines of code\n          2) Scalability - New gestures can be added under 5 lines of code\n          3) Configurability\n          4) Reusability"
  },
  {
   "imageUrl": "images/portfolio/arduino-04.png",
   "projectName": "Natsu",
   "projectCategory": "Image Processing",
   "projectLink": "https://github.com/shubham-pyc/NATSU",
   "projectDescription": "Created a Wireless Bluetooth controller Arduino robot which could be controlled through Hand Gestured.\n          - Created Hand Recognization script with python used OpenCV library for Image Processing\n          - Used Convexity Defects and Convex Hull algorithms for finding gestures.\n          - Programmed Arduino microcontroller for receiving signals from Bluetooth and send signals to motors accordingly"
  },
  {
   "imageUrl": "images/portfolio/webapp.jpg",
   "projectName": "Chatapp",
   "projectCategory": "Webapp",
   "projectLink": "https://github.com/shubham-pyc/Chat-Application"
  },
  {
   "imageUrl": "images/portfolio/chrome-extension.png",
   "projectLink": "https://github.com/shubham-pyc/empower_util",
   "projectName": "Enhanced Empower",
   "projectCategory": "Chrome Extensions",
   "projectDescription": "- Designed Chrome extension for office to display real-time in-office timings.\n          - Automatically injecting working hours on a particular day in timesheets.\n          "
  },
  {
   "imageUrl": "images/portfolio/chat-benefits.png",
   "projectName": "Chat Microservice for a Social Media Website",
   "projectCategory": "Microservice",
   "projectDescription": "- Implemented chat and user notification microservice for a social networking website www.vomvos.com\n          - Used STOMP protocol and simple message broker (Queue)\n          - Integrated Cassandra Database for faster reads and writes\n          - Used Java SpringBoot for creating the microservice."
  },
  {
   "imageUrl": "images/portfolio/snake.png",
   "liveLink": "https://shubham-pyc.github.io/snake-game/",
   "projectName": "Snake",
   "projectCategory": "Game Development",
   "projectDescription": "A classic snake game demonstrating the use of Linked List.\n          - Designed whole games on HTML canvas and wrote javascript for graphic design\n          - Wrote Algorithm for moving snake properly in streamline flow\n          - Implemented Collision detection between snake and apple with 100% accuracy by pixel\n          - Implemented Controller for the snake in plain javascript"
  }
 ]
}